In [12]:
import pandas as pd
#pip install tabula -py
#precisa ter o java instalado
import tabula
#pip install python-docx
import docx
from docx import Document
from docx.shared import Inches

In [9]:
#Manipular Pdf

tabelas=tabula.read_pdf("estatistica_enem.pdf", pages=[2,4,8],  multiple_tables=True)
print(len(tabelas))
display(tabelas)

for tabela in tabelas:
    display(tabela)

2

[          Produção Emissão de dióxido de carbono
 0   (em toneladas)  (em partes por milhão - ppm)
 1              1,1                          2,14
 2              1,2                          2,30
 3              1,3                          2,46
 4              1,4                          2,64
 5              1,5                          2,83
 6              1,6                          3,03
 7              1,7                          3,25
 8              1,8                          3,48
 9              1,9                          3,73
 10             2,0                          4,00,
          Mês   Cotação   Ano
 0    Outubro  R$ 83,00  2007
 1   Novembro  R$ 73,10  2007
 2   Dezembro  R$ 81,60  2007
 3    Janeiro  R$ 82,00  2008
 4  Fevereiro  R$ 85,30  2008
 5      Março  R$ 84,00  2008
 6      Abril  R$ 84,60  2008]

          Produção Emissão de dióxido de carbono
0   (em toneladas)  (em partes por milhão - ppm)
1              1,1                          2,14
2              1,2                          2,30
3              1,3                          2,46
4              1,4                          2,64
5              1,5                          2,83
6              1,6                          3,03
7              1,7                          3,25
8              1,8                          3,48
9              1,9                          3,73
10             2,0                          4,00

         Mês   Cotação   Ano
0    Outubro  R$ 83,00  2007
1   Novembro  R$ 73,10  2007
2   Dezembro  R$ 81,60  2007
3    Janeiro  R$ 82,00  2008
4  Fevereiro  R$ 85,30  2008
5      Março  R$ 84,00  2008
6      Abril  R$ 84,60  2008

In [1]:
from pdfminer.high_level import extract_text
text=extract_text("estatistica_enem.pdf")
print(text)

In [2]:
tabula.convert_into("estatistica_enem.pdf", "excel.csv", output_format="csv", pages="18")

NameError: name 'tabula' is not defined

In [ ]:
#Manipulando arquivos excel
ler=pd.read_csv("excel.csv", encoding="utf-8")
ler.to_excel("excel.xlsx", index=None, header=True)

In [ ]:
tabela_excel=pd.read_excel("excel.xlsx")
display(tabela_excel)

  Candidato Quimica  Fisica
0         I      20      23
1        II       x      25
2       III      21      18

In [ ]:
#[Linhas,colunas]
tabela_excel.loc[tabela_excel['Fisica']==25,"Quimica"]=20
tabela_excel.to_excel('table2.xlsx')
Outro=pd.read_excel('table2.xlsx', index_col=0)

display(Outro)

  Candidato  Quimica  Fisica
0         I       20      23
1        II       20      25
2       III       21      18

In [ ]:
#Manipulando documento word existente

document=docx.Document("Poema.docx")
document.paragraphs[0].text
document.paragraphs[0].runs[0].text

'De tudo, ao meu amor serei atento'

In [ ]:
# Criando um documento word e adicionando coisas

documento=Document()
titulo=input("Que titulo deseja")
documento.add_heading(titulo,0)
documento.add_heading("Pudim de caramelo", level=1)

documento.add_picture("pudimdecaramelo.jpg", width=docx.shared.Inches(6), height=docx.shared.Cm(9))

documento.add_paragraph("Confeitarias Juan", style='Intense Quote')
documento.add_paragraph("Ingredientes", style="List Bullet")
documento.add_paragraph("1 lata de leite condensado", style="List Number")
documento.add_paragraph("1 litro de leite", style='List Number')
documento.add_paragraph("4 ovos inteiros", style='List Number')
documento.save("documento.docx")

Que titulo desejaComo fazer pudim